Revit 2027 API
TopographySurface.MaterialId Property
 The id of the material applied to this element.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId MaterialId { get; set; }
Public Property MaterialId As ElementId
	Get
	Set
public:
property ElementId^ MaterialId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member MaterialId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The materialId cannot map to a valid material element.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 This applies to TopographySurface and SiteSubRegion elements.
See Also
Reference
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace